Week6/Day1-Ironhack/sandwichr/app/views/sandwiches/ingredient.html.erb

<ul>
<%@my_sandwich.ingredients.each do |ingredient|%>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ?  [["sandwich_id", 1]]