Week6/Day1-Ironhack/sandwichr/app/views/sandwich_views/show.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ?  [["sandwich_id", 1]]
---
  <%total_calories=0%>
<%@sandwich.ingredients.each do |ingredient|%>