Week6/Day1-Ironhack/sandwichr/app/controllers/sandwiches_controller.rb

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
	  @sandwich = Sandwich.find_by(id: params[:id])

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 0]]
SELECT "ingredients".* FROM "ingredients"
---
		def ingredient
			@my_sandwich = Sandwich.find(params[:id])
	    @my_ingredients = Ingredient.all

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]
---
		def add_ingredient
			my_sandwich = Sandwich.find_by(id: params[:id])
			my_ingredient = Ingredient.find_by(id: params[:ingredient])