Week6/Day1-Ironhack/sandwichr/app/controllers/sandwich_views_controller.rb

  def index
    @sandwiches = Sandwich.all
---
SELECT "sandwiches".* FROM "sandwiches"

  def show
    @sandwich = Sandwich.find_by(id: params[:id])
    @ingredients= Ingredient.all
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ingredients".* FROM "ingredients"

  def add_ingredient
    my_sandwich = Sandwich.find_by(id: params[:id])
    my_ingredient = Ingredient.find_by(id: params[:ingredient])
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 2]]